#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "e3d7307003c2ff32d9e1373938624458" -> "c6dfca67309390d7714103225bc8985c"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "b55493ad8482498cd57b63ee989e2b95" -> "358325f3f0ee74805b342dea1566a17e"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "d6c5a5c5759a845b7cedf02761249070" -> "d03d9e5c49dc4297445b3abbc815c35f"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "9a030cbc5d3187e39b003fd7f2aabaf9" -> "cb0e79925e044d77e0b90156fc7ad3a7"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "86376ed65e4772cec0ce8694af17da57" -> "0f2ab27dcdbec2afe6c8594d700d278a"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "989d26a9c762ae67725f2da3aa5f93bb" -> "cc51d1d2a621212d470e92ec237d4d0f"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "1d436d6787cde496f3aa2be6ec5cec13" -> "ce45fb68a9ead1642d7be241ea2bc928"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "6d7adfd7eb2bd3ac125b71e771c9db3c" -> "cb60b8cde624b29c9fb594104496c0a2"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "97068fdd4005e4d6c95bb89c684da6fa" -> "d83834f4248f1f1529b558c92d042bea"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "3888241f70c5d2b5245bd906e0787d0f" -> "aa5326fe5ffdfcb16dfd2e6365b2322a"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "aceebfdf40bafa8264f2e2d3f46a8575" -> "b904366e040145ecd4c6f325b56bc467"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "b306572900d203c95b162189053d694b" -> "7ab62a552ed41f8ef5f9c29be253e56e"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "39b748b49362e65b47f7aa3337e87f18" -> "5f7f5e32c0fe8a0b37aee576d396d2eb"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "23ba45bb0d3cd0c14bca50cc73c9163c" -> "2a114ca5d671717218ca89d52b04e093"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "a0aeeb9ac89f6d4edbca3ec1061c836d" -> "94314f926c30566a02181cfd66549415"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "f0756313784d5e63215b122cdd795efa" -> "eea961d5f5c375df49b5440d05036c1b"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "5248eaabc37af3fd53e5b09bd7dad30b" -> "d4200b411379b44a9775c62741597e96"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "c06cbd8bb27d928adaeb78a7542bcf0a" -> "f31d07635370d28b2974506446811fb9"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "f7b1ba80cc170b7262829f2af8bcdafe" -> "224e82f03250005730a6dc1ee6520494"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "22da3ed5064edfbc9ef0c6b6ffaf7e74" -> "d8b64ff65b597a8930e07ff00ac83c63"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "58462de39bd692ca8765ca9a129b8bd4" -> "b877ffa6118d6bbf10d7bc0f6a96349f"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "eadf60d5ee4262073c06cbdaf2ce1f42" -> "e0554231fd85bc77639c3b0eb5f0e2be"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "84d083f2b0999c391b7df628a5ec36e2" -> "a3551f7b4b1a11dba50f7bc0854edda9"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "510fb40b6200816909009a8517b4ed85" -> "d46771f173c248f9f4a94bb233613756"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "6ab248cf39ea7512441273b842ecaf1f" -> "1ded1c3a6f8403ee8b4301d4a727b137"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "9a37ae7609fa8a805472b4f07d0fa2f1" -> "219807b96dc53a28e7990e9d5026dd92"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "95c467d1517cf63292fa04dc773f0d8f" -> "ac4e37cc93e32be57bb5308d7ca8c77f"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be created
  + resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "10dee1e6046de454e447f453225192bf"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/get_tags_by_company_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/get_tags_by_company_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "d1045d8f6402d750613b9704f77391df" -> "e22e16afc725efa112c63533b7bfba2b"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "7a0f6725a3e3ced8b805266dbc1d2575" -> "0279ba688b9ebd44ccbae3d17f34b510"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "1e0bb79791f46adeccf05c4f65527a5e" -> "f2d0ac1cacb7c2a18a4223a9c826690a"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "5814eedded9fe655b60e6d58e8c31b97" -> "5f866346fe22771cc35a9f97ba9373b4"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "b5b3c834dec9011b5eb6018af0b1b09b" -> "3a69c058a616fd6e0d0c4e282f394d09"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "39fd90b2905335812c3c98dffe2b870f" -> "2b898c7d755bd9dbe5d32b91fa7bf958"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "affdd8ab0d2eb1fdb0e3e7d29fb99593" -> "792f76e28bbef51ea85c294dc04fff55"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "d1a147fff0e4c1127595f020c1ee6069" -> "2bfb8fb92d4bc68d4e5340a6764d4223"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "9fb6decb622c0f56e5301c64ba56e152" -> "e7831e311e4874cc8f54f7e4d43acf22"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "927cb2352ebd796fb597b178dc197b68" -> "3c7ad83cce60f0335ee514b621f2f5dd"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "ef816ab7733ee155c0f58f8242ba8f52" -> "6b6352b3ea7b95ec89c2d3c1f99a425d"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "MSHwkZl9+MRNjpqS2Mhiexw9kt7kXEY/G39IQu1v5xo=" -> "Mq4NV5aHKoTSz6K/6rBXWBhkNcXFQS8WrwlN7ogGdrI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "fsfLINYfGWfngVfi3UUKhs121EmNcD2AcFl2f3rUCyY=" -> "uniPJdRbv2Opzm11HLwwadpVuu7eAz24XwEVa0Krps0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "EiJGirJmFr2+wtEcSzF6/MclnHlbnoxoFLerEp0D9V0=" -> "9LwdO5pJLuk/U5S0k+2xENR306PcCV7oRyP6h3a7LCY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "PwNIzWD8sggGLSFSyAZ767MROB1XR2YlWMCsZM65MKE=" -> "KIke1aetXLizEsJNfiaE8To9ObUj4lc0VzkolCf09UM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "OWas56QxAggrHI0sbKJ3k1lBmQYKSh+vzHPQm4yW6Rs=" -> "bENVEyttXVYzj7xwxEXnVsktQJ4++Xd2Uvj2m0rYqTo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "KSP+RWS+UvxXzk+Fwa4zrc92EwfEa9NpNXibuaJbthk=" -> "8uJFwTghnpj8XaNnL5EyYGsNeq0DjqCCNhffL6UQaHc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "3fJhm/ji9Q/VT126SEKt1I61mXxGlnn1tSOh1K1eNbw=" -> "a/s38G3xuBtknODXv79jTvV4gQklCmy4U+xo8X2T41c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "JGkxAGocywI+vPrFRppaHmxM6FDGWT1AJgd6mYVzePw=" -> "Pl+236GiGiOd6Yf5gGYwqhm3UebBLgQ06VIcIJqIsEU="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "ovZzTt/RhHfCogIdi4SKLAX19kBpQGEAVq8/YfpHeBg=" -> "Nr9SZrbPQg917tx56rd5CA1f24IK3UaCoXYqLZdYXLI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "ry5IZhvZQXlsJSOb+rVNPeJmfoagC68qe+iGx+h7+ck=" -> "bo8W8aeEQhNePJxoB4Hxc1JJqCIBDz/irluXcdni0AU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "BwEpx+NzFjQ05yRaudNnosF+Zp27iLrbUTvFNa2g2HY=" -> "HuR982xv4GGuPmDy4YI9g8KmgzSSYDVAI/Pq7Z/lTHk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "wb5UPoMGzbBmEtFhlVFdgtrw81ObpG+zMLW6UjLsX44=" -> "BUS+4kXSZlGKNGVFU4R5gKk+UK1ckrntkc44USgs1r4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "jkbjS3zP9yl8I9lVPjrKniqMXqmbmr7D7mMUr2xabKg=" -> "mePIr6XzXR3EY9gKdI9/AfarGXA/8sqYyYPK3UyWYj8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "2dUxeSuC3HRd5ckJNOBJHmLxVfCuxqddavacHA/Yy08=" -> "SyKz+e+WlOvyfpgUpN3pLpSmBIIcDu7Lo2E3pUFi2OQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "IACNWALSi5jo7B/5QfbOFMH+ncoqApz/wCXGEZWM/zw=" -> "4ss7cRRWWoUuT8wu+z0gp0e+PJ9jJIJcoEW8OU9ix5M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:23.086+0000" -> (known after apply)
      ~ source_code_hash               = "st6ZxvECvQ2utv5Ym+hqZmd5ydh/HDDR+0VTS01ZzVk=" -> "PmVEbSriU7rdsR4XMdUXK/fdDEpKBhAVAow2HzBt7Es="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "agarURpwJ5k2XqADb2zGp1Svb1CUcnlXvEevh4lzq5M=" -> "Q1E1Tx5REgy/tVMbLCOhR3B+Qep92wkjmtS8McHhhgA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "RdhngHElLOKzpEFlx/hto/gJ/6VXhlBLrUZvBIk1qVw=" -> "+RcBIXZ9Jgn4odZymx3OHRJ3MKnEDSvnazD+2kNlL9c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "4W43Fu7SEZzzoH+9gGfHejos6UT69raPGBVbicN4jiI=" -> "gopz0Kcg1QfAN8DxI6zyphzthRzrk7aTfaCvuU96Nwk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "O2NJo2BUVBOMMcKEsYG6ylKuUsj+YWPYOff38BdEwWY=" -> "U/Pdi4p83Gs4qTEFL9Ls7sC3ywqZFzO33yKZh1Mh6DA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "IUR2trABaJh8lZcWQI0tMhq5P0tgt5Wni3sH8PnqwsI=" -> "VIQ4CqxZra8/OI9+L85rHsDm5HWyBeGRe22WJ1KeuMA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "wsirE8StrIGEO00/oLiw0pHZpTew2LO4HvPOc1KzEUI=" -> "9v8jfzGADDpBE/L6gxr95qjAaffyFF71gBPKURlihPM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "2dFBbw61xP8cr55rQ1tdXgKZV1mlW+TQa08rWUHekaQ=" -> "aXWse7isnKlPQSRb0YKopVHN5GPoANutXWaHQhp72gg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "jhVmgieH63sjb0Q+eIwSozxDMZGyBWKkcpzaLVgUy2s=" -> "TkwnETuqTed6l7OxHWxDowzpk1XdoohKAnkRlNeOlbE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "rfSETxWmIDCxE3Sz/yT21QGPIZnlhjQXX6GI/nP1dEA=" -> "BAInI7ohJ6gy7tob78depfZx+J/uSTU+yVNGOm+QbBo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "QAL28N0rR8pAnoAB76hZzYjw7BhNSbW2UDRQauCQuUM=" -> "qx2LkCw3BdQZXdXkBcyxT7diNdUW+3jEGr5F9Fq3Swo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "yL1o7Y+IUnHT8n9GHwKRJ029sG4FJuHLF8ISeXLz/lY=" -> "fYUofNNP0hQLAXoIa7aAQrrD+Fy0bj4dQ+0ru7gp5v4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be created
  + resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_get_tags_by_company_lambda_function"
      + handler                        = "get_tags_by_company_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/get_tags_by_company_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "XP53fWIEjkZSfmx8txd8k9F5U9hVEI7qi+UvtY61kjI="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive)
              + "DB_HOST"      = (sensitive)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive)
              + "DB_USERNAME"  = (sensitive)
              + "SECRET_KEY"   = (sensitive)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "UVQUWalksA8snMWPP2FsSL79LfGNvnlRXMzK/vT7B6g=" -> "U+t4tscL1Ya+j30RM/Aesgy3QiYokVehNFww6PQM4rc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "VoUwIMDWBHtANVZyFbrzuBCDBfVlWAZ1vF1CK37qsy4=" -> "+p6GdgTJGvUZrXIbP3kt55pUXxO8lCLN7dx/nVF7+6s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "P+keut76Dp0S5kWaW1p6Iz12hm2PLL76zhifeN31TH8=" -> "1bFlh1DFblNxZ85hWtTXuU1wU0yGA1hpTqWFVj1ss6c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "QNNnoK51BPfY6JyD5N0qzcNt8I0nIi/FFBWUbtHDU9s=" -> "boT1GhJD941yEHJTdy4Rj1ah2+uehqXw9Jjg5qXscT8="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "dHw5z7IDVnNO7/UyCpf0P/3j9QRvGwKznALj0kFqDBc=" -> "pW/d4SBabvVLTIG15uyT6KBKSClr3yGRAwh7JHpiLyo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "YNWa76kJ9nR8/gCXgIHfhyCa1erdNrfm0AgLINnRLUM=" -> "gpYgAjbf/oNcGm+3u8f9EfR1oZn6KR2zpHBcolooStk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "QM2rVbEUuCEL+fjQGrwXHKpkLZwK78RstWlLEKrcV2k=" -> "SCY044FsqJFVyFQv0c+aBcIA0db7de0idZz8RtxVSRM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "EJ9bT0pgeDx6T+PvjnVlrfPrdocgEZfOltgKMKENKb4=" -> "9p0fVFMZK4ZduTqHi1WGpeUew1VLDF+mq/kNae3dGvw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "WRDlzaQQbkncPCuEGuCZBfdI4ytbYQuXlThbYewRRHE=" -> "TCLe2ose+Y1/nlzKn0moxIWoUxX+pq5m5IEGWXdEX4g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "W8BDS1NQKBQbbQNaA90zpZc9O6HIZBA792czWdepkJE=" -> "mNxfqoYxYO93MlHqqn7ZnnVgz6Q/44xQlEQlGJ4zriM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-10-11T22:27:35Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "ret4qs" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-10-11T22:27:32Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.logs.aws_cloudwatch_log_group.get_tags_by_company_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "get_tags_by_company_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_get_tags_by_company_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.network.aws_api_gateway_integration.get_tags_by_company_integration will be created
  + resource "aws_api_gateway_integration" "get_tags_by_company_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_method.get_tags_by_company_method will be created
  + resource "aws_api_gateway_method" "get_tags_by_company_method" {
      + api_key_required = false
      + authorization    = "CUSTOM"
      + authorizer_id    = "3y14fs"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_resource.tags_by_company will be created
  + resource "aws_api_gateway_resource" "tags_by_company" {
      + id          = (known after apply)
      + parent_id   = "hper4a"
      + path        = (known after apply)
      + path_part   = "tags"
      + rest_api_id = "kb7gblbu69"
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-10-11T22:29:18Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

  # module.policy.aws_iam_role.get_tags_by_company_lambda_exec_role will be created
  + resource "aws_iam_role" "get_tags_by_company_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo_get_tags_by_company_lambda_exec_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role_policy.get_tags_by_company_cognito_policy will be created
  + resource "aws_iam_role_policy" "get_tags_by_company_cognito_policy" {
      + id     = (known after apply)
      + name   = "demo_get_tags_by_company_cognito_policy"
      + policy = (sensitive)
      + role   = (known after apply)
    }

  # module.policy.aws_iam_role_policy_attachment.get_tags_by_company_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "get_tags_by_company_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function"
      + role       = "demo_get_tags_by_company_lambda_exec_role"
    }

  # module.policy.aws_iam_role_policy_attachment.get_tags_by_company_lambda_vpc will be created
  + resource "aws_iam_role_policy_attachment" "get_tags_by_company_lambda_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function"
      + role       = "demo_get_tags_by_company_lambda_exec_role"
    }

  # module.policy.aws_lambda_permission.apigw_get_tags_by_company_lambda will be created
  + resource "aws_lambda_permission" "apigw_get_tags_by_company_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "demo_get_tags_by_company_lambda_function"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (sensitive)
      + statement_id  = "AllowExecutionFromAPIGatewayGetTagsByCompany"
    }

Plan: 12 to add, 77 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*